{
  "home_title": "Skin Disease Detection System",
  "home_subtitle": "Upload your skin image to get an initial analysis.",
  "home_supported_diseases": "Currently supports detection for: Monkeypox, Chickenpox, and Measles.",
  "uploader_drop_zone_title": "Drag & drop an image here",
  "uploader_drop_zone_subtitle": "or click to select a file",
  "uploader_drop_zone_hint": "JPG, PNG, WEBP (Max 5MB)",
  "uploader_or": "OR",
  "uploader_use_camera_button": "Use Camera",
  "uploader_webcam_title": "Position the Camera",
  "uploader_capture_button": "Capture Image",
  "uploader_switch_camera_button": "Switch Camera",
  "uploader_cancel_button": "Cancel",
  "uploader_detect_button": "Detect Disease",
  "uploader_analyzing": "Analyzing",
  "uploader_error_file_invalid": "Invalid file.",
  "uploader_error_file_size": "Max file size is 5MB.",
  "uploader_error_file_format": "Only JPG, PNG, WEBP formats are allowed.",
  "uploader_error_no_image": "Please select or capture an image first.",
  "uploader_error_webcam_capture": "Failed to capture image from webcam.",
  "uploader_error_api_config": "API URL is not configured. Please check your environment variables.",
  "uploader_error_prediction": "An error occurred during prediction.",
  "status_loading": "Analyzing your image...",
  "status_wait": "Please wait a moment.",
  "status_error_title": "Oops! An Error Occurred",
  "result_confidence_label": "Confidence Level",
  "result_suggestions_title": "Next Suggestions:",
  "result_learn_more_button": "Learn More",
  "result_disclaimer_title": "IMPORTANT",
  "result_disclaimer_text": "This detection result is for initial information and is NOT a medical diagnosis. Model accuracy may vary. Always consult a doctor or healthcare professional for an accurate diagnosis and proper medical treatment.",
  "disease_chickenpox_name": "Chickenpox",
  "disease_chickenpox_description": "A highly contagious viral infection causing an itchy rash with small, fluid-filled blisters.",
  "disease_chickenpox_suggestion_1": "Consult a doctor for proper diagnosis and treatment.",
  "disease_chickenpox_suggestion_2": "Get enough rest and drink plenty of fluids.",
  "disease_chickenpox_suggestion_3": "Avoid scratching the blisters to prevent scarring and infection.",
  "disease_chickenpox_suggestion_4": "Use calamine lotion or take an oatmeal bath to relieve itching.",
  "disease_measles_name": "Measles",
  "disease_measles_description": "A highly contagious childhood viral infection that is preventable by a vaccine.",
  "disease_measles_suggestion_1": "Contact a doctor immediately if you or your child is suspected of having measles.",
  "disease_measles_suggestion_2": "Ensure the patient gets adequate rest and fluid intake.",
  "disease_measles_suggestion_3": "Self-isolate to prevent the spread of the virus.",
  "disease_monkeypox_name": "Monkeypox",
  "disease_monkeypox_description": "A rare viral disease that causes a rash and flu-like symptoms.",
  "disease_monkeypox_suggestion_1": "Immediately consult with a doctor or the nearest health facility.",
  "disease_monkeypox_suggestion_2": "Self-isolate to prevent transmission.",
  "disease_monkeypox_suggestion_3": "Avoid scratching the rash to prevent secondary infections.",
  "disease_monkeypox_suggestion_4": "Maintain personal and environmental hygiene.",
  "disease_normal_name": "Normal Skin",
  "disease_normal_description": "No significant skin abnormalities were detected based on the uploaded image.",
  "disease_normal_suggestion_1": "Continue to maintain your skin's hygiene and health.",
  "disease_normal_suggestion_2": "Use sunscreen to protect your skin from UV exposure.",
  "disease_normal_suggestion_3": "If you have any concerns, consult a dermatologist.",
  "disease_unknown_name": "Unknown",
  "disease_unknown_description": "The detection result could not be specifically categorized.",
  "disease_unknown_suggestion_1": "Please consult a medical professional for further evaluation.",
  "nav_home": "Home",
  "nav_about": "About Us",
  "nav_faq": "FAQ",
  "footer_disclaimer_title": "Disclaimer:",
  "footer_disclaimer_text": "This application is an assistive tool and does not replace professional medical diagnosis. Always consult with a qualified doctor or healthcare professional for an accurate diagnosis and treatment.",
  "footer_copyright": "© {{year}} NeuroDerma. All rights reserved.",
  "about_page_title": "About NeuroDerma",
  "about_page_subtitle": "Welcome to <strong>NeuroDerma: Smart Pox Identification via Neural Networks</strong>. This innovative project is designed as a smart auxiliary tool for the initial identification of several common skin conditions through AI-based image analysis.",
  "about_page_back_button": "Back to Home",
  "about_accordion_mission_title": "Our Mission",
  "about_accordion_mission_content": "Our mission is to empower individuals by providing easily accessible skin health information and an intuitive early detection tool. We believe that awareness and early detection are key to more effective treatment.",
  "about_accordion_tech_title": "Technology",
  "about_accordion_tech_content": "NeuroDerma utilizes <em>machine learning</em> and neural networks, with a responsive Next.js interface.",
  "about_accordion_disclaimer_title": "Important to Remember",
  "about_accordion_disclaimer_content_1": "NeuroDerma is an informational tool, <strong>not a substitute for professional medical diagnosis</strong>.",
  "about_accordion_disclaimer_content_2": "Accuracy can be affected by image quality. Direct consultation with a doctor or dermatologist is the most appropriate step for any medical concerns.",
  "about_accordion_contact_title": "Contact Us",
  "about_accordion_contact_content": "We highly value your feedback. Contact us via <1>email</1> or visit our <3>contact page</3>.",
  "faq_page_title": "Frequently Asked Questions",
  "faq_page_subtitle": "Find answers to frequently asked questions about NeuroDerma.",
  "faq_contact_link": "Contact us",
  "faq_back_button": "Back to Home",
  "faq_q1": "Can this application replace a visit to the doctor?",
  "faq_a1": "No. This application is designed as an initial informational aid and should not be considered a substitute for professional medical diagnosis. If you have concerns about your skin health, always consult with a doctor or dermatologist.",
  "faq_q2": "How accurate are the detection results from this application?",
  "faq_a2": "The accuracy of our machine learning model can vary depending on many factors, including the quality of the uploaded image, lighting, and individual variations in disease symptoms. The results are predictive and should always be confirmed by a medical professional.",
  "faq_q3": "What skin diseases can this application detect?",
  "faq_a3": "Currently, our model is trained to attempt to recognize several conditions such as Monkeypox, Chickenpox, and Measles, and to distinguish them from normal skin. This list may expand in the future.",
  "faq_q4": "How can I get the best detection results?",
  "faq_a4": "Ensure that the image you upload is of good quality, in focus, and with sufficient lighting. The affected skin area should be clearly visible. Avoid using filters or editing the image.",
  "faq_q5": "Is my image data secure?",
  "faq_a5": "We are committed to protecting user privacy. All images uploaded for prediction purposes are not stored on our system after the prediction process is complete. Images are only used temporarily to run the analysis and are automatically deleted without being saved on any server or database. Thus, your data remains secure and protected.",
  "faq_q6": "What should I do if the detection results indicate a possible disease?",
  "faq_a6": "If the detection results indicate a possible skin condition, do not panic. The best step is to immediately make an appointment with a doctor or dermatologist for further examination and an accurate diagnosis.",
  "disease_chickenpox_symptoms_detail": "Chickenpox symptoms typically appear 10 to 21 days after exposure to the virus. A prodromal period (early symptoms before the rash) is more common in adolescents and adults and may include muscle aches, nausea, loss of appetite, and headache. In children, the disease may not be preceded by prodromal symptoms, and the first sign can be a rash or lesions in the oral cavity.\n\nThe main symptoms of chickenpox include:\n- **Itchy rash:** This is the most characteristic symptom. The rash usually starts on the chest, back, and face, then spreads to the entire body, including the scalp, arms, and legs. The rash can also appear on mucous membranes, such as inside the mouth and in the genital area.\n- **Fever:** Usually mild to moderate (rarely higher than 39°C). The fever generally lasts for 3 to 5 days.\n- **Fatigue and a general feeling of being unwell (malaise):** Sufferers often feel weak and uncomfortable.\n- **Headache:** Often accompanies other symptoms.\n- **Sore throat (pharyngitis):** Can occur in some cases.\n- **Loss of appetite**.\n\nThe chickenpox rash develops through several stages:\n1. **Red spots or bumps (papules):** Appear over several days.\n2. **Fluid-filled blisters (vesicles):** Form within about a day from the papules, then break and leak fluid. The fluid is initially clear then becomes cloudy.\n3. **Scabs (crusts):** Cover the broken blisters and take several more days to heal. These scabs will eventually fall off.\nNew bumps continue to appear for several days, so a person may have bumps, blisters, and scabs all at the same time. Extreme itching is often a major problem and can disrupt sleep.",
  "disease_chickenpox_causes_detail": "Chickenpox is caused by:\n- **a primary infection with the Varicella-Zoster Virus (VZV)**, which is a member of the herpes virus family (Herpesviridae). This virus is also known as human herpesvirus type 3. After the primary infection (chickenpox), VZV remains in the body (in sensory nerve ganglia) as a latent infection. The virus can reactivate years later to cause herpes zoster (shingles).",
  "disease_chickenpox_transmission_detail": "Chickenpox is highly contagious. The virus spreads from person to person in several ways:\n\n- **Direct contact:** Through direct touch with the chickenpox or shingles blisters of an infected person.\n- **Airborne:** Through inhalation of aerosols from the vesicular fluid of chickenpox or shingles skin lesions. The virus can also spread through infected respiratory secretions that may also become aerosolized when an infected person coughs or sneezes.\n- **Contact with contaminated surfaces:** Although considered a less significant transmission mechanism than direct or airborne contact, the virus can spread through contact with surfaces contaminated with fluid from an infected person's blisters.\nA person with chickenpox can spread the virus from 1 to 2 days before the rash appears until all blisters have dried and formed scabs (usually 4-7 days after the rash onset).",
  "disease_chickenpox_prevention_detail": "The most effective way to prevent chickenpox is through vaccination. The chickenpox vaccine is very safe and effective in preventing the disease. The majority of people who get the vaccine will not get chickenpox. If a vaccinated person does get chickenpox (known as a \"breakthrough infection\"), the symptoms are usually much milder with fewer blisters, little or no fever, and a quicker recovery.\n\nBesides vaccination, other preventive measures include:\n\n- **Avoiding close contact** with people who have chickenpox or shingles until all their lesions have dried up.\n- **Good hygiene practices**, such as washing hands regularly, especially after touching objects or surfaces that may be contaminated.\n- **Isolating infected individuals:** People with chickenpox should stay home and avoid contact with others, especially those who have never had chickenpox or have not been vaccinated, until all their blisters have dried up.",
  "disease_chickenpox_whentoseedoctor_detail": "Although chickenpox is generally a mild illness in healthy children, it is important to contact a doctor if you or your child shows symptoms of chickenpox, especially if:\n\n- **The infected person has a weakened immune system** (e.g., due to HIV/AIDS, cancer, organ transplant, or use of immunosuppressive drugs).\n- **The infected person is a pregnant woman** who has never had chickenpox or has not been vaccinated.\n- **The infected person is a newborn** (less than 1 month old).\n- **The infected person is an adolescent or adult**, as the disease tends to be more severe in this age group.\n- **The rash spreads to one or both eyes.**\n- **The rash becomes very red, warm, or tender to the touch**, which may indicate a secondary bacterial skin infection.\n- **The patient experiences more serious symptoms**, such as:\n - Difficulty breathing or a severe cough (could be a sign of pneumonia).\n - Stiff neck, confusion, difficulty walking, or persistent vomiting (could be signs of encephalitis or brain inflammation).\n - A very high fever or a fever that lasts more than 4 days.\n - Unusual bleeding or bruising.\n - Dehydration (dry mouth, little or no urine, dizziness).\n\nA doctor can confirm the diagnosis, recommend treatment to relieve symptoms, and monitor for possible complications. In some cases, especially in high-risk individuals, a doctor may prescribe antiviral medication such as acyclovir to reduce the severity and duration of the illness if given within the first 24 hours of the rash appearing.",
  "disease_measles_symptoms_detail": "Measles symptoms usually appear 7 to 14 days after a person is infected with the virus. The illness generally begins with non-specific symptoms (prodromal period) that last for 2-4 days before the characteristic measles rash appears.\n\n  Early (prodromal) symptoms include:\n\n  - **High fever**: Often the first symptom and can reach over 40°C.\n  - **The three Cs**:\n    - **Cough**: Usually a dry, persistent cough.\n    - **Coryza (Runny nose)**: A runny and stuffy nose.\n    - **Conjunctivitis**: Red, watery eyes that are sensitive to light (photophobia).\n  - **Fatigue and a general feeling of being unwell (Malaise)**.\n  - **Koplik's spots**: This is a pathognomonic (specific) sign for measles. Small, bluish-white spots on a reddish base appear inside the mouth, on the buccal mucosa, usually opposite the lower molars. These spots appear 1-2 days before the skin rash and last for a few days.\n\n  After the prodromal period, a **reddish maculopapular rash (exanthem)** appears:\n  - The rash usually begins on the face, around the hairline and behind the ears.\n  - It then spreads downward to the neck, torso, arms, and legs within 24-48 hours.\n  - The rash consists of small, flat red spots (macules) that then become raised (papules). These spots often merge (coalesce) as they spread.\n  - The rash usually lasts for 5-6 days and then fades in the same order it appeared, often leaving a brownish discoloration and peeling skin.\n\n  The fever usually peaks when the rash appears and subsides within a few days afterward.",
  "disease_measles_causes_detail": "Measles is caused by:\n\n  - **infection with the measles virus (Measles morbillivirus)**, a member of the Morbillivirus genus in the Paramyxoviridae family. It is a single-stranded RNA virus that is highly contagious. Humans are the only natural reservoir for the measles virus.",
  "disease_measles_transmission_detail": "Measles is one of the most contagious diseases in the world. The virus spreads through:\n\n  - **Airborne**: When an infected person coughs or sneezes, small droplets containing the virus are spread into the air. Others can become infected by inhaling these droplets or if the droplets land on a surface and are then touched by someone who then touches their eyes, nose, or mouth.\n  - **Direct contact**: With the nasal or throat secretions of an infected person.\n\n  The measles virus can remain active and contagious in the air or on infected surfaces for up to 2 hours. A person with measles can spread the virus from 4 days before to 4 days after the rash appears. The period of highest transmissibility is during the prodromal period (when symptoms like cough and runny nose appear) before the rash is evident.",
  "disease_measles_prevention_detail": "The most effective way to prevent measles is through vaccination. The measles vaccine is very safe and effective. It is usually given as part of the combination MMR (Measles, Mumps, Rubella) or MMRV (Measles, Mumps, Rubella, Varicella) vaccine.\n\n  - **Routine Vaccination**: WHO recommends two doses of the vaccine for all children. The first dose is usually given at 9-12 months of age in countries with high measles incidence, and at 12-15 months in countries with low incidence. The second dose is usually given between 15-18 months of age or at school entry (4-6 years), depending on the national immunization schedule.\n  - **Outbreak Response Immunization**: During an outbreak, vaccination can be administered to susceptible individuals to help control the spread.\n  - **Immunoglobulin (IG)**: For susceptible individuals who have been exposed to the measles virus (e.g., infants, pregnant women, people with weakened immune systems), immunoglobulin can be administered within 6 days of exposure to prevent or lessen the disease.\n \n  Other preventive measures include:\n\n  - **Isolating infected individuals**: People with measles should be isolated for 4 days after the onset of the rash to prevent further spread.\n  - **Good hygiene practices**: Although the primary transmission is airborne, hand washing and covering the mouth when coughing or sneezing can help.\n  - **Ensuring good ventilation in public spaces**.",
  "disease_measles_whentoseedoctor_detail": "Contact a doctor immediately if you or your child:\n\n  - **Suspect you have measles**, especially if there is a history of exposure or you are not fully vaccinated.\n  - **Experience measles symptoms**, such as a high fever accompanied by a cough, runny nose, red eyes, and then a rash appears.\n  - **Belong to a high-risk group for complications, such as**:\n    - **Infants and young children** (under 5 years of age).\n    - **Adults over 20 years of age**.\n    - **Pregnant women**.\n    - **People with a weakened immune system** (e.g., due to leukemia, HIV infection, or immunosuppressive treatment).\n\n  - **Experience any of the following complications**:\n    - **Ear infection (otitis media)**: Ear pain, fluid discharge from the ear.\n    - **Severe diarrhea**.\n    - **Difficulty breathing or chest pain (pneumonia)**: This is the most common cause of measles-related death in young children.\n    - **Signs of encephalitis (brain inflammation)**: Severe headache, stiff neck, seizures, excessive drowsiness, confusion, or coma. This is a serious complication that can cause permanent brain damage or death.\n    - **Dehydration**.\n    - **Seizures caused by fever**.\n\n  Early diagnosis is important for proper management and to prevent further spread. A doctor will confirm the diagnosis and recommend supportive care to relieve symptoms and monitor for complications. There is no specific antiviral treatment for measles, but vitamin A supplements are recommended by the WHO for children with measles in areas with vitamin A deficiency, as it can reduce severity and mortality risk.",
  "disease_monkeypox_symptoms_detail": "Mpox symptoms generally appear within 5 to 21 days after exposure to the virus. Early symptoms are often flu-like, followed by the appearance of a rash.\n\n**Common Symptoms:**\n\n- **Rash**: This is the hallmark symptom of Mpox. The rash usually begins on the face and spreads throughout the body, including the palms of the hands and soles of the feet. The rash can also appear in the genital area, mouth, or throat. It progresses through several stages: flat spots, then fluid-filled blisters (which can be itchy or painful), then pus-filled blisters, which harden into scabs and finally fall off within 2 to 4 weeks.\n- **Fever**\n- **Headache**\n- **Muscle and back pain**\n- **Swollen lymph nodes (lymphadenopathy)**: This is a key distinguishing feature of Mpox from other diseases like chickenpox.\n- **Fatigue or lack of energy**\n- **Chills**\n- **Sore throat**\n\nIn some cases, the first symptom to appear is the rash, while others may experience fever or muscle pain first. Some people may also experience rectal inflammation (proctitis), rectal bleeding, or pain during urination (dysuria) or swallowing.\n\n**Complications:**\n\nSerious complications can occur, including secondary bacterial skin infections, pneumonia, sepsis, encephalitis (brain infection), and eye infections that can lead to vision loss.",
  "disease_monkeypox_causes_detail": "Mpox is caused by infection with the Monkeypox virus (MPXV), which belongs to the Orthopoxvirus genus in the Poxviridae family. This genus also includes the variola virus (the cause of smallpox) and the vaccinia virus (used in the smallpox vaccine).\n\nMPXV is a double-stranded DNA virus. The virus is zoonotic, meaning it can be transmitted from animals to humans. (Anwar et al., 2023; Kumar et al., 2023) Although it is called \"monkeypox\" because it was first identified in laboratory monkeys in 1958, monkeys are not the main reservoir of the virus. It is believed that rodents are the natural reservoir of MPXV.\n\nThe first human case was reported in 1970 in the Democratic Republic of Congo.",
  "disease_monkeypox_transmission_detail": "Mpox transmission can occur in several ways:\n\n1. **From Animal to Human (Zoonosis)**:\n\n- Direct contact with the blood, bodily fluids, or skin or mucosal lesions of infected animals (such as rodents and primates). (Anwar et al., 2023; Lawal et al., 2024)\n- Consuming improperly cooked meat from infected wild animals. (WHO, n.d. - general information, supported by the zoonotic nature of the virus)\n\n2. **From Human to Human**:\n\n- **Close contact with infectious lesions, scabs, or body fluids**: This is the main route of transmission. Contact can be skin-to-skin, including during sexual activity.\n- **Respiratory droplets**: Transmission through respiratory droplets usually requires prolonged, close face-to-face contact.\n- **Contact with contaminated materials**: Such as clothing, bedding, or surfaces that have recently been touched by an infected person.\n- **Vertical transmission (mother to child)**: The virus can be transmitted from a mother to her fetus during pregnancy (congenital Mpox) or during or after childbirth through close contact.\n\nStudies show that the virus can be detected in saliva, nasopharynx, and semen for extended periods, and rashes often appear in the genital area, supporting transmission through sexual contact. A person is considered infectious until all lesions have healed and a new layer of skin has formed.",
  "disease_monkeypox_prevention_detail": "Mpox prevention measures include:\n\n1. **Avoiding Contact with Infected Individuals or Animals**:\n- Avoid close contact, including skin-to-skin and sexual contact, with people who have a rash that might be Mpox or who have been diagnosed with Mpox.\n- Avoid contact with animals that could be infected with the virus (sick or dead animals in Mpox-endemic areas).\n- Avoid contact with materials that have been in contact with a sick animal or human (e.g., bedding, clothing).\n\n2. **Good Hygiene Practices**:\n\n- Wash hands frequently with soap and water or use an alcohol-based hand sanitizer, especially after contact with a sick person or their environment.\n\n3. **Use of Personal Protective Equipment (PPE)**:\n\n- Healthcare workers and others caring for Mpox patients should use appropriate PPE (gown, mask, gloves, eye protection).\n\n4. **Isolation of Infected Individuals**:\n\nPeople with Mpox should be isolated to prevent further transmission until all their lesions have healed and a new layer of skin has formed.\n\n5. **Vaccination**:\n\n- The vaccine used to prevent smallpox also provides protection against Mpox. A newer vaccine specifically for Mpox has also been developed (e.g., JYNNEOS).\n\n- Vaccination is recommended for people at high risk of exposure, including some healthcare workers and those who have been exposed to the virus. (CDC, 2023; Saggedu et al., 2022)\n\n6. **Awareness and Education**:\n\n- Increasing awareness about the risks, symptoms, and transmission routes of Mpox in the community.",
  "disease_monkeypox_whentoseedoctor_detail": "Seek medical help immediately if you:\n\n- **Develop a new, unexplained rash**: Especially if the rash is accompanied by flu-like symptoms such as fever, headache, muscle aches, or swollen lymph nodes.\n- **Suspect you have been exposed to Mpox**: If you have had close contact with someone diagnosed with Mpox or who has symptoms consistent with Mpox.\n- **Have Mpox symptoms and are at high risk for severe disease:** This includes people with weakened immune systems, young children, pregnant women, and people with pre-existing skin conditions.\n- **Experience severe symptoms**: Such as difficulty breathing, confusion, dehydration, or secondary skin infections.\n- **Have a rash in sensitive areas**: Such as the eyes, mouth, or genital area, which causes severe pain or difficulty eating/drinking.\n\nEarly diagnosis is important to get proper care, prevent further spread, and allow for contact tracing. A doctor will perform a physical exam and may take a sample from a skin lesion for laboratory testing to confirm the diagnosis.",
  "info_accordion_symptoms": "Symptoms",
  "info_accordion_causes": "Causes",
  "info_accordion_transmission": "Transmission",
  "info_accordion_prevention": "Prevention",
  "info_accordion_doctor": "When To See The Doctor?"
}