{
  "home_title": "Sistem Deteksi Penyakit Kulit",
  "home_subtitle": "Unggah gambar kulit Anda untuk mendapatkan analisis awal.",
  "home_supported_diseases": "Saat ini mendukung deteksi untuk: Cacar Monyet, Cacar Air, dan Campak.",
  "uploader_drop_zone_title": "Seret & lepas gambar di sini",
  "uploader_drop_zone_subtitle": "atau klik untuk memilih file",
  "uploader_drop_zone_hint": "JPG, PNG, WEBP (Maks 5MB)",
  "uploader_or": "ATAU",
  "uploader_use_camera_button": "Gunakan Kamera",
  "uploader_webcam_title": "Posisikan Kamera",
  "uploader_capture_button": "Ambil Gambar",
  "uploader_switch_camera_button": "Ganti Kamera",
  "uploader_cancel_button": "Batal",
  "uploader_detect_button": "Deteksi Penyakit",
  "uploader_analyzing": "Menganalisis",
  "uploader_error_file_invalid": "File tidak valid.",
  "uploader_error_file_size": "Ukuran file maks 5MB.",
  "uploader_error_file_format": "Format hanya JPG, PNG, WEBP.",
  "uploader_error_no_image": "Silakan pilih atau ambil gambar terlebih dahulu.",
  "uploader_error_webcam_capture": "Gagal mengambil gambar dari webcam.",
  "uploader_error_api_config": "URL API tidak dikonfigurasi. Silakan periksa variabel lingkungan Anda.",
  "uploader_error_prediction": "Terjadi kesalahan saat prediksi.",
  "status_loading": "Menganalisis gambar Anda...",
  "status_wait": "Mohon tunggu sebentar.",
  "status_error_title": "Oops! Terjadi Kesalahan",
  "result_confidence_label": "Tingkat Kepercayaan",
  "result_suggestions_title": "Saran Selanjutnya:",
  "result_learn_more_button": "Pelajari Lebih Lanjut",
  "result_disclaimer_title": "PENTING",
  "result_disclaimer_text": "Hasil deteksi ini bersifat sebagai informasi awal dan BUKAN merupakan diagnosis medis. Akurasi model dapat bervariasi. Selalu konsultasikan dengan dokter atau tenaga kesehatan profesional untuk diagnosis yang akurat dan penanganan medis yang tepat.",
  "disease_chickenpox_name": "Cacar Air",
  "disease_chickenpox_description": "Infeksi virus sangat menular yang menyebabkan ruam gatal dengan lepuh kecil berisi cairan.",
  "disease_chickenpox_suggestion_1": "Konsultasikan dengan dokter untuk diagnosis dan penanganan yang tepat.",
  "disease_chickenpox_suggestion_2": "Istirahat yang cukup dan minum banyak cairan.",
  "disease_chickenpox_suggestion_3": "Hindari menggaruk lepuh untuk mencegah bekas luka dan infeksi.",
  "disease_chickenpox_suggestion_4": "Gunakan losion kalamin atau mandi oatmeal untuk meredakan gatal.",
  "disease_measles_name": "Campak",
  "disease_measles_description": "Infeksi virus masa kanak-kanak yang sangat menular dan dapat dicegah dengan vaksin.",
  "disease_measles_suggestion_1": "Segera hubungi dokter jika Anda atau anak Anda diduga menderita campak.",
  "disease_measles_suggestion_2": "Pastikan penderita mendapatkan istirahat yang cukup dan asupan cairan yang memadai.",
  "disease_measles_suggestion_3": "Isolasi diri untuk mencegah penyebaran virus.",
  "disease_monkeypox_name": "Cacar Monyet",
  "disease_monkeypox_description": "Penyakit virus langka yang menyebabkan ruam dan gejala mirip flu.",
  "disease_monkeypox_suggestion_1": "Segera konsultasikan dengan dokter atau fasilitas kesehatan terdekat.",
  "disease_monkeypox_suggestion_2": "Isolasi diri untuk mencegah penularan.",
  "disease_monkeypox_suggestion_3": "Hindari menggaruk ruam untuk mencegah infeksi sekunder.",
  "disease_monkeypox_suggestion_4": "Jaga kebersihan diri dan lingkungan.",
  "disease_normal_name": "Kulit Normal",
  "disease_normal_description": "Tidak terdeteksi adanya kelainan kulit signifikan berdasarkan gambar yang diunggah.",
  "disease_normal_suggestion_1": "Lanjutkan menjaga kebersihan dan kesehatan kulit Anda.",
  "disease_normal_suggestion_2": "Gunakan tabir surya untuk melindungi kulit dari paparan sinar UV.",
  "disease_normal_suggestion_3": "Jika ada keluhan, konsultasikan dengan dokter kulit.",
  "disease_unknown_name": "Tidak Diketahui",
  "disease_unknown_description": "Hasil deteksi tidak dapat dikategorikan secara spesifik.",
  "disease_unknown_suggestion_1": "Harap konsultasikan dengan profesional medis untuk evaluasi lebih lanjut.",
  "nav_home": "Beranda",
  "nav_about": "Tentang Kami",
  "nav_faq": "FAQ",
  "footer_disclaimer_title": "Disclaimer:",
  "footer_disclaimer_text": "Aplikasi ini adalah alat bantu dan tidak menggantikan diagnosis medis profesional. Selalu konsultasikan dengan dokter atau tenaga kesehatan yang berkualifikasi untuk diagnosis dan penanganan yang akurat.",
  "footer_copyright": "© {{year}} NeuroDerma. Hak cipta dilindungi undang-undang.",
  "about_page_title": "Tentang NeuroDerma",
  "about_page_subtitle": "Selamat datang di <strong>NeuroDerma: Smart Pox Identification via Neural Networks</strong>. Proyek inovatif ini dirancang sebagai alat bantu cerdas untuk identifikasi awal beberapa kondisi kulit umum melalui analisis gambar berbasis kecerdasan buatan.",
  "about_page_back_button": "Kembali ke Halaman Utama",
  "about_accordion_mission_title": "Misi Kami",
  "about_accordion_mission_content": "Misi kami adalah memberdayakan individu dengan menyediakan informasi kesehatan kulit yang mudah diakses dan alat deteksi dini yang intuitif. Kami percaya bahwa kesadaran dan deteksi awal adalah kunci untuk penanganan yang lebih efektif.",
  "about_accordion_tech_title": "Teknologi",
  "about_accordion_tech_content": "NeuroDerma memanfaatkan <em>machine learning</em> dan neural networks, dengan antarmuka Next.js yang responsif",
  "about_accordion_disclaimer_title": "Penting untuk Diingat",
  "about_accordion_disclaimer_content_1": "NeuroDerma adalah alat bantu informasi, <strong>bukan pengganti diagnosis medis profesional</strong>.",
  "about_accordion_disclaimer_content_2": "Akurasi dapat dipengaruhi oleh kualitas gambar. Konsultasi langsung dengan dokter atau dermatologis adalah langkah yang paling tepat untuk setiap kekhawatiran medis.",
  "about_accordion_contact_title": "Hubungi Kami",
  "about_accordion_contact_content": "Kami sangat menghargai masukan Anda. Hubungi kami melalui <1>email</1> atau kunjungi <3>halaman kontak</3> kami.",
  "faq_page_title": "Pertanyaan Umum",
  "faq_page_subtitle": "Temukan jawaban untuk pertanyaan yang sering diajukan mengenai NeuroDerma.",
  "faq_contact_link": "Hubungi kami",
  "faq_back_button": "Kembali ke Halaman Utama",
  "faq_q1": "Apakah aplikasi ini dapat menggantikan kunjungan ke dokter?",
  "faq_a1": "Tidak. Aplikasi ini dirancang sebagai alat bantu informasi awal dan tidak boleh dianggap sebagai pengganti diagnosis medis profesional. Jika Anda memiliki kekhawatiran tentang kesehatan kulit Anda, selalu konsultasikan dengan dokter atau dermatologis.",
  "faq_q2": "Seberapa akurat hasil deteksi dari aplikasi ini?",
  "faq_a2": "Akurasi model machine learning kami dapat bervariasi tergantung pada banyak faktor, termasuk kualitas gambar yang diunggah, pencahayaan, dan variasi individu pada gejala penyakit. Hasilnya bersifat prediktif dan harus selalu dikonfirmasi oleh profesional medis.",
  "faq_q3": "Penyakit kulit apa saja yang dapat dideteksi oleh aplikasi ini?",
  "faq_a3": "Saat ini, model kami dilatih untuk mencoba mengenali beberapa kondisi seperti Cacar Monyet (Monkeypox), Cacar Air (Chickenpox), dan Campak (Measles), serta membedakannya dari kulit normal. Daftar ini mungkin berkembang di masa depan.",
  "faq_q4": "Bagaimana cara mendapatkan hasil deteksi terbaik?",
  "faq_a4": "Pastikan gambar yang Anda unggah memiliki kualitas yang baik, fokus, dan dengan pencahayaan yang cukup. Area kulit yang bermasalah harus terlihat jelas. Hindari penggunaan filter atau pengeditan pada gambar.",
  "faq_q5": "Apakah data gambar saya aman?",
  "faq_a5": "Kami berkomitmen untuk menjaga privasi pengguna. Semua gambar yang diunggah untuk keperluan prediksi tidak disimpan di sistem kami setelah proses prediksi selesai. Gambar hanya digunakan sementara untuk menjalankan analisis, dan akan dihapus secara otomatis tanpa disimpan di server atau basis data manapun. Dengan demikian, data Anda tetap aman dan terlindungi.",
  "faq_q6": "Apa yang harus saya lakukan jika hasil deteksi menunjukkan kemungkinan suatu penyakit?",
  "faq_a6": "Jika hasil deteksi menunjukkan kemungkinan adanya suatu kondisi kulit, jangan panik. Langkah terbaik adalah segera membuat janji temu dengan dokter atau dermatologis untuk pemeriksaan lebih lanjut dan diagnosis yang akurat.",
  "disease_chickenpox_symptoms_detail": "Gejala cacar air biasanya muncul 10 hingga 21 hari setelah paparan virus. Periode prodromal (gejala awal sebelum timbulnya ruam) lebih sering terjadi pada remaja dan orang dewasa, dan dapat berupa nyeri otot, mual, penurunan nafsu makan, dan sakit kepala. Pada anak-anak, penyakit ini mungkin tidak didahului oleh gejala prodromal, dan tanda awalnya bisa berupa ruam atau lesi di rongga mulut.\n\nGejala utama cacar air meliputi:\n- **Ruam yang gatal:** Ini adalah gejala paling khas. Ruam biasanya dimulai di dada, punggung, dan wajah, kemudian menyebar ke seluruh tubuh, termasuk kulit kepala, lengan, dan kaki. Ruam juga bisa muncul di selaput lendir, seperti di dalam mulut dan di area genital.\n- **Demam:** Biasanya demam ringan hingga sedang (jarang lebih tinggi dari 39°C). Demam umumnya berlangsung selama 3 hingga 5 hari.\n- **Kelelahan dan perasaan tidak enak badan (malaise):** Penderita sering merasa lemas dan tidak nyaman.\n- **Sakit kepala:** Sering menyertai gejala lainnya.\n- **Nyeri tenggorokan (faringitis):** Dapat terjadi pada beberapa kasus.\n- **Kehilangan selera makan**.\n\nRuam cacar air berkembang melalui beberapa tahap:\n1. **Bintik-bintik merah atau benjolan (papula):** Muncul selama beberapa hari.\n2. **Lepuh berisi cairan (vesikel):** Terbentuk dalam waktu sekitar satu hari dari papula, kemudian pecah dan mengeluarkan cairan. Cairan awalnya bening kemudian menjadi keruh.\n3. **Koreng (krusta):** Menutupi lepuh yang sudah pecah dan membutuhkan beberapa hari lagi untuk sembuh. Koreng ini kemudian akan rontok.\nBenjolan baru terus muncul selama beberapa hari, sehingga penderita mungkin memiliki benjolan, lepuh, dan koreng secara bersamaan. Rasa gatal yang ekstrem seringkali menjadi masalah utama dan dapat mengganggu tidur.",
  "disease_chickenpox_causes_detail": "Cacar air disebabkan oleh:\n- **infeksi primer virus Varicella-Zoster (VZV)**, yang merupakan anggota dari keluarga virus herpes (Herpesviridae). Virus ini juga dikenal sebagai human herpesvirus type 3. Setelah infeksi primer (cacar air), VZV tetap berada di dalam tubuh (di ganglia saraf sensorik) sebagai infeksi laten. Virus ini dapat aktif kembali bertahun-tahun kemudian menyebabkan herpes zoster (cacar ular).",
  "disease_chickenpox_transmission_detail": "Cacar air sangat menular. Virus ini menyebar dari orang ke orang melalui beberapa cara:\n\n- **Kontak langsung:** Melalui sentuhan langsung dengan lepuh cacar air atau herpes zoster dari orang yang terinfeksi.\n- **Udara (airborne):** Melalui inhalasi aerosol dari cairan vesikel lesi kulit cacar air atau herpes zoster. Virus ini juga dapat menyebar melalui sekresi pernapasan yang terinfeksi yang mungkin juga menjadi aerosol ketika orang yang terinfeksi batuk atau bersin.\n- **Kontak dengan permukaan yang terkontaminasi:** Meskipun dianggap sebagai mekanisme penularan yang kurang signifikan dibandingkan kontak langsung atau udara, virus dapat menyebar melalui kontak dengan permukaan yang terkontaminasi cairan dari lepuh orang yang terinfeksi.\nSeseorang dengan cacar air dapat menyebarkan virus mulai dari 1 hingga 2 hari sebelum ruam muncul hingga semua lepuh telah mengering dan membentuk koreng (biasanya 4-7 hari setelah timbulnya ruam).",
  "disease_chickenpox_prevention_detail": "Cara paling efektif untuk mencegah cacar air adalah melalui vaksinasi. Vaksin cacar air sangat aman dan efektif dalam mencegah penyakit ini. Mayoritas orang yang mendapatkan vaksin tidak akan terkena cacar air. Jika seseorang yang telah divaksinasi tetap terkena cacar air (dikenal sebagai \"breakthrough infection\"), gejalanya biasanya jauh lebih ringan dengan lebih sedikit lepuh, demam ringan atau tanpa demam, dan pemulihan yang lebih cepat.\n\nSelain vaksinasi, langkah-langkah pencegahan lainnya meliputi:\n\n- **Menghindari kontak dekat** dengan orang yang terinfeksi cacar air atau herpes zoster sampai semua lesi mereka mengering.\n- **Praktik kebersihan yang baik**, seperti mencuci tangan secara teratur, terutama setelah menyentuh benda atau permukaan yang mungkin terkontaminasi.\n- **Isolasi orang yang terinfeksi:** Orang dengan cacar air harus tinggal di rumah dan menghindari kontak dengan orang lain, terutama mereka yang belum pernah terkena cacar air atau belum divaksinasi, sampai semua lepuh mereka mengering.",
  "disease_chickenpox_whentoseedoctor_detail": "Meskipun cacar air umumnya merupakan penyakit ringan pada anak-anak yang sehat, penting untuk menghubungi dokter jika Anda atau anak Anda menunjukkan gejala cacar air, terutama jika:\n\n- **Orang yang terinfeksi memiliki sistem kekebalan tubuh yang lemah** (misalnya, karena HIV/AIDS, kanker, transplantasi organ, atau penggunaan obat imunosupresif).\n- **Orang yang terinfeksi adalah wanita hamil** yang belum pernah menderita cacar air atau belum divaksinasi.\n- **Orang yang terinfeksi adalah bayi baru lahir** (kurang dari 1 bulan).\n- **Orang yang terinfeksi adalah remaja atau orang dewasa**, karena penyakit ini cenderung lebih parah pada kelompok usia ini.\n- **Ruam menyebar ke satu atau kedua mata.**\n- **Ruam menjadi sangat merah, hangat, atau nyeri saat disentuh**, yang mungkin menandakan infeksi bakteri sekunder pada kulit.\n- **Penderita mengalami gejala yang lebih serius**, seperti:\n - Kesulitan bernapas atau batuk parah (bisa menjadi tanda pneumonia).\n - Leher kaku, kebingungan, kesulitan berjalan, atau muntah terus-menerus (bisa menjadi tanda ensefalitis atau radang otak).\n - Demam yang sangat tinggi atau demam yang berlangsung lebih dari 4 hari.\n - Pendarahan atau memar yang tidak biasa.\n - Dehidrasi (mulut kering, sedikit atau tidak ada urin, pusing).\n\nDokter dapat mengkonfirmasi diagnosis, merekomendasikan perawatan untuk meredakan gejala, dan memantau kemungkinan komplikasi. Pada beberapa kasus, terutama pada individu berisiko tinggi, dokter mungkin meresepkan obat antivirus seperti asiklovir untuk mengurangi keparahan dan durasi penyakit jika diberikan dalam 24 jam pertama setelah timbulnya ruam.",
  "disease_measles_symptoms_detail": "Gejala campak biasanya muncul 7 hingga 14 hari setelah seseorang terinfeksi virus. Penyakit ini umumnya dimulai dengan gejala non-spesifik (periode prodromal) yang berlangsung selama 2-4 hari sebelum munculnya ruam khas campak.\n\n  Gejala awal (prodromal) meliputi:\n\n  - **Demam tinggi**: Seringkali merupakan gejala pertama dan bisa mencapai lebih dari 40°C.\n  - **Tiga C (The three Cs)**:\n    - **Batuk (Cough)**: Biasanya batuk kering dan persisten.\n    - **Pilek (Coryza/Runny nose)**: Hidung meler dan tersumbat.\n    - **Konjungtivitis (Conjunctivitis)**: Mata merah, berair, dan sensitif terhadap cahaya (fotofobia).\n  - **Kelelahan dan perasaan tidak enak badan (Malaise)**.\n  - **Bintik Koplik (Koplik's spots)**: Ini adalah tanda patognomonik (spesifik) untuk campak. Bintik-bintik kecil berwarna putih kebiruan dengan dasar kemerahan muncul di dalam mulut, pada selaput lendir pipi (mukosa bukal), biasanya berlawanan dengan gigi geraham bawah. Bintik ini muncul 1-2 hari sebelum ruam kulit dan berlangsung selama beberapa hari.\n\n  Setelah periode prodromal, muncul **ruam makulopapular kemerahan (exanthem)**:\n  - Ruam biasanya dimulai di wajah, di sekitar garis rambut dan di belakang telinga.\n  - Kemudian menyebar ke bawah ke leher, batang tubuh, lengan, dan kaki dalam waktu 24-48 jam.\n  - Ruam terdiri dari bintik-bintik merah kecil yang rata (makula) yang kemudian menjadi menonjol (papula). Bintik-bintik ini seringkali menyatu (koalesen) saat menyebar.\n  - Ruam biasanya berlangsung selama 5-6 hari dan kemudian memudar dengan urutan yang sama seperti saat muncul, seringkali meninggalkan perubahan warna kecoklatan dan pengelupasan kulit.\n\n  Demam biasanya memuncak saat ruam muncul dan mereda dalam beberapa hari setelahnya.",
  "disease_measles_causes_detail": "Campak disebabkan oleh:\n\n  - **infeksi virus campak (Measles morbillivirus)**, anggota genus Morbillivirus dalam keluarga Paramyxoviridae. Ini adalah virus RNA untai tunggal yang sangat menular. Manusia adalah satu-satunya reservoir alami untuk virus campak.",
  "disease_measles_transmission_detail": "Campak adalah salah satu penyakit yang paling menular di dunia. Virus ini menyebar melalui:\n\n  - **Udara (Airborne)**: Ketika orang yang terinfeksi batuk atau bersin, tetesan kecil (droplet) yang mengandung virus menyebar ke udara. Orang lain dapat terinfeksi dengan menghirup tetesan ini atau jika tetesan tersebut mendarat di permukaan dan kemudian disentuh oleh orang lain yang kemudian menyentuh mata, hidung, atau mulut mereka.\n  - **Kontak langsung**: Dengan sekresi hidung atau tenggorokan dari orang yang terinfeksi.\n\n  Virus campak dapat tetap aktif dan menular di udara atau pada permukaan yang terinfeksi hingga 2 jam. Seseorang dengan campak dapat menyebarkan virus mulai dari 4 hari sebelum hingga 4 hari setelah ruam muncul. Periode penularan tertinggi adalah selama periode prodromal (ketika gejala seperti batuk dan pilek muncul) sebelum ruam menjadi jelas.",
  "disease_measles_prevention_detail": "Cara paling efektif untuk mencegah campak adalah melalui vaksinasi. Vaksin campak sangat aman dan efektif. Biasanya diberikan sebagai bagian dari vaksin kombinasi MMR (Measles, Mumps, Rubella) atau MMRV (Measles, Mumps, Rubella, Varicella).\n\n  - **Vaksinasi Rutin**: WHO merekomendasikan dua dosis vaksin untuk semua anak. Dosis pertama biasanya diberikan pada usia 9-12 bulan di negara-negara dengan insiden campak tinggi, dan pada usia 12-15 bulan di negara-negara dengan insiden rendah. Dosis kedua biasanya diberikan antara usia 15-18 bulan atau saat masuk sekolah (4-6 tahun), tergantung pada jadwal imunisasi nasional.\n  - **Vaksinasi Tanggap Darurat (Outbreak Response Immunization)**: Selama wabah, vaksinasi dapat diberikan kepada individu yang rentan untuk membantu mengendalikan penyebaran.\n  - **Imunoglobulin (IG)**: Untuk individu yang rentan dan telah terpapar virus campak (misalnya, bayi, wanita hamil, orang dengan sistem kekebalan yang lemah), imunoglobulin dapat diberikan dalam waktu 6 hari setelah paparan untuk mencegah atau meringankan penyakit.\n \n  Langkah-langkah pencegahan lainnya meliputi:\n\n  - **Isolasi orang yang terinfeksi**: Orang dengan campak harus diisolasi selama 4 hari setelah timbulnya ruam untuk mencegah penyebaran lebih lanjut.\n  - **Praktik kebersihan yang baik**: Meskipun penularan utama melalui udara, mencuci tangan dan menutupi mulut saat batuk atau bersin dapat membantu.\n  - **Memastikan ventilasi yang baik di ruang publik**.",
  "disease_measles_whentoseedoctor_detail": "Segera hubungi dokter jika Anda atau anak Anda:\n\n  - **Mencurigai terkena campak**, terutama jika ada riwayat paparan atau belum divaksinasi lengkap.\n  - **Mengalami gejala campak**, seperti demam tinggi disertai batuk, pilek, mata merah, dan kemudian muncul ruam.\n  - **Termasuk dalam kelompok berisiko tinggi untuk komplikasi, seperti**:\n    - **Bayi dan anak kecil** (di bawah usia 5 tahun).\n    - **Orang dewasa di atas 20 tahun**.\n    - **Wanita hamil**.\n    - **Orang dengan sistem kekebalan tubuh yang lemah** (misalnya, karena leukemia, infeksi HIV, atau pengobatan imunosupresif).\n\n  - **Mengalami salah satu dari komplikasi berikut**:\n    - **Infeksi telinga (otitis media)**: Nyeri telinga, keluar cairan dari telinga.\n    - **Diare berat**.\n    - **Kesulitan bernapas atau nyeri dada (pneumonia)**: Ini adalah penyebab kematian terkait campak yang paling umum pada anak kecil.\n    - **Tanda-tanda ensefalitis (radang otak)**: Sakit kepala hebat, leher kaku, kejang, kantuk berlebihan, kebingungan, atau koma. Ini adalah komplikasi serius yang dapat menyebabkan kerusakan otak permanen atau kematian.\n    - **Dehidrasi**.\n    - **Kejang yang disebabkan oleh demam**.\n\n  Diagnosis dini penting untuk penanganan yang tepat dan untuk mencegah penyebaran lebih lanjut. Dokter akan mengkonfirmasi diagnosis dan merekomendasikan perawatan suportif untuk meredakan gejala dan memantau komplikasi. Tidak ada pengobatan antivirus spesifik untuk campak, tetapi suplemen vitamin A direkomendasikan oleh WHO untuk anak-anak dengan campak di daerah dengan kekurangan vitamin A, karena dapat mengurangi keparahan dan risiko kematian.",
  "disease_monkeypox_symptoms_detail": "Gejala Mpox umumnya muncul dalam 5 hingga 21 hari setelah terpapar virus. Gejala awal seringkali mirip flu, diikuti dengan munculnya ruam.\n\n**Gejala Umum:**\n\n- **Ruam**: Ini adalah gejala khas Mpox. Ruam biasanya dimulai di wajah dan menyebar ke seluruh tubuh, termasuk telapak tangan dan kaki. Ruam juga bisa muncul di area genital, mulut, atau tenggorokan. Ruam berkembang melalui beberapa tahap: bintik datar, kemudian lepuh berisi cairan (yang bisa gatal atau nyeri), lalu lepuh berisi nanah, mengeras menjadi keropeng, dan akhirnya rontok dalam 2 hingga 4 minggu.\n- **Demam**\n- **Sakit kepala**\n- **Nyeri otot dan punggung**\n- **Pembengkakan kelenjar getah bening (limfadenopati)**: Ini adalah ciri pembeda utama Mpox dari penyakit lain seperti cacar air.\n- **Kelelahan atau kekurangan energi**\n- **Menggigil**\n- **Sakit tenggorokan**\n\nPada beberapa kasus, gejala pertama yang muncul adalah ruam, sementara yang lain mungkin mengalami demam atau nyeri otot terlebih dahulu. Beberapa orang mungkin juga mengalami peradangan rektum (proktitis), perdarahan rektum, atau nyeri saat buang air kecil (disuria) atau menelan.\n\n**Komplikasi:**\n\nKomplikasi serius dapat terjadi, termasuk infeksi bakteri sekunder pada kulit, pneumonia, sepsis, ensefalitis (infeksi otak), dan infeksi mata yang dapat menyebabkan kehilangan penglihatan.",
  "disease_monkeypox_causes_detail": "Mpox disebabkan oleh infeksi virus Monkeypox (MPXV), yang termasuk dalam genus Orthopoxvirus dalam famili Poxviridae. Genus ini juga mencakup virus variola (penyebab cacar) dan virus vaccinia (digunakan dalam vaksin cacar).\n\nMPXV adalah virus DNA untai ganda. Virus ini bersifat zoonosis, artinya dapat ditularkan dari hewan ke manusia. (Anwar et al., 2023; Kumar et al., 2023) Meskipun disebut \"monkeypox\" karena pertama kali diidentifikasi pada monyet di laboratorium pada tahun 1958, monyet bukanlah reservoir utama virus ini. Diperkirakan hewan pengerat (rodentia) merupakan reservoir alami MPXV.\n\nKasus pertama pada manusia dilaporkan pada tahun 1970 di Republik Demokratik Kongo.",
  "disease_monkeypox_transmission_detail": "Penularan Mpox dapat terjadi melalui beberapa cara:\n\n1. **Dari Hewan ke Manusia (Zoonosis)**:\n\n- Kontak langsung dengan darah, cairan tubuh, atau lesi kulit atau mukosa dari hewan yang terinfeksi (seperti hewan pengerat dan primata). (Anwar et al., 2023; Lawal et al., 2024)\n- Mengkonsumsi daging hewan liar yang terinfeksi yang tidak dimasak dengan baik. (WHO, n.d. - informasi umum, didukung oleh sifat zoonosis virus)\n\n2. **Dari Manusia ke Manusia**:\n\n- **Kontak dekat dengan lesi infeksius, keropeng, atau cairan tubuh**: Ini adalah rute utama penularan. Kontak bisa berupa sentuhan kulit-ke-kulit, termasuk selama aktivitas seksual.\n- **Droplet pernapasan**: Penularan melalui droplet pernapasan biasanya memerlukan kontak tatap muka yang lama dan dekat.\n- **Kontak dengan bahan yang terkontaminasi**: Seperti pakaian, tempat tidur, atau permukaan yang baru saja disentuh oleh orang yang terinfeksi.\n- **Penularan vertikal (ibu ke anak)**: Virus dapat menular dari ibu ke janin selama kehamilan (Mpox kongenital) atau selama atau setelah persalinan melalui kontak dekat.\n\nStudi menunjukkan bahwa virus dapat terdeteksi dalam air liur, nasofaring, dan sperma untuk periode yang lama, dan ruam sering muncul di area genital, yang mendukung penularan melalui kontak seksual. Seseorang dianggap menularkan penyakit sampai semua lesi sembuh dan lapisan kulit baru terbentuk.",
  "disease_monkeypox_prevention_detail": "Langkah-langkah pencegahan Mpox meliputi:\n\n1. **Menghindari Kontak dengan Individu atau Hewan yang Terinfeksi**:\n- Hindari kontak dekat, termasuk kontak kulit-ke-kulit dan seksual, dengan orang yang memiliki ruam yang mungkin merupakan Mpox atau yang telah didiagnosis Mpox.\n- Hindari kontak dengan hewan yang mungkin terinfeksi virus (hewan yang sakit atau mati di daerah endemik Mpox).\n- Hindari kontak dengan bahan yang telah bersentuhan dengan hewan atau manusia yang sakit (misalnya, tempat tidur, pakaian).\n\n2. **Praktik Kebersihan yang Baik**:\n\n- Sering mencuci tangan dengan sabun dan air atau menggunakan pembersih tangan berbasis alkohol, terutama setelah kontak dengan orang sakit atau lingkungannya.\n\n3. **Penggunaan Alat Pelindung Diri (APD)**:\n\n- Petugas kesehatan dan orang lain yang merawat pasien Mpox harus menggunakan APD yang sesuai (gaun, masker, sarung tangan, pelindung mata).\n\n4. **Isolasi Individu yang Terinfeksi**:\n\nOrang dengan Mpox harus diisolasi untuk mencegah penularan lebih lanjut sampai semua lesi mereka sembuh dan lapisan kulit baru telah terbentuk.\n\n5. **Vaksinasi**:\n\n- Vaksin yang digunakan untuk mencegah cacar juga memberikan perlindungan terhadap Mpox. Vaksin yang lebih baru khusus untuk Mpox juga telah dikembangkan (misalnya, JYNNEOS).\n\n- Vaksinasi direkomendasikan untuk orang-orang yang berisiko tinggi terpapar, termasuk beberapa petugas kesehatan dan mereka yang telah terpapar virus. (CDC, 2023; Sagheddu et al., 2022)\n\n6. **Kesadaran dan Pendidikan**:\n\n- Meningkatkan kesadaran tentang risiko, gejala, dan rute penularan Mpox di masyarakat.",
  "disease_monkeypox_whentoseedoctor_detail": "Segera cari pertolongan medis jika Anda:\n\n- **Mengembangkan ruam baru yang tidak dapat dijelaskan**: Terutama jika ruam tersebut disertai dengan gejala mirip flu seperti demam, sakit kepala, nyeri otot, atau pembengkakan kelenjar getah bening.\n- **Mencurigai telah terpapar Mpox**: Jika Anda melakukan kontak dekat dengan seseorang yang didiagnosis Mpox atau memiliki gejala yang konsisten dengan Mpox.\n- **Memiliki gejala Mpox dan berisiko tinggi mengalami penyakit parah:** Ini termasuk orang dengan sistem kekebalan tubuh yang lemah, anak kecil, wanita hamil, dan orang dengan kondisi kulit yang sudah ada sebelumnya.\n- **Mengalami gejala yang parah**: Seperti kesulitan bernapas, kebingungan, dehidrasi, atau infeksi sekunder pada kulit.\n- **Ruam di area sensitif**: Seperti mata, mulut, atau area genital, yang menyebabkan nyeri hebat atau kesulitan makan/minum.\n\nDiagnosis dini penting untuk mendapatkan perawatan yang tepat, mencegah penyebaran lebih lanjut, dan memungkinkan pelacakan kontak. Dokter akan melakukan pemeriksaan fisik dan mungkin mengambil sampel dari lesi kulit untuk pengujian laboratorium guna mengkonfirmasi diagnosis.",
  "info_accordion_symptoms": "Gejala",
  "info_accordion_causes": "Penyebab",
  "info_accordion_transmission": "Penularan",
  "info_accordion_prevention": "Pencegahan",
  "info_accordion_doctor": "Kapan ke Dokter?"

}